README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org4a9ffc9)
2.  [Resumo e/ou informação extra:](#org7edc9fc)
3.  [Versão:](#org84d961d)
4.  [Data:](#org8335c69)
5.  [Autor de Contato:](#org99dcf16)
6.  [Lista dos Autores:](#orga8cae37)
7.  [Áreas de pesquisa vinculadas:](#org1df3551)
8.  [Vinculo com:](#orgd4c203f)
9.  [Paradigmas:](#org929265d)
10. [Tipo de Interface:](#org03eb3d0)
11. [Plataformas Suportadas:](#orgebfe9ce)
12. [Linguagens Utilizadas:](#orgf4d6643)
13. [Bibliotecas Utilizadas (dependências):](#org9f218d6)
14. [Softwares utilizados (dependências)](#org9a0c2a7)
15. [Tipo de Licença:](#org3438a1c)
16. [Links:](#org311f01b)


<a id="org4a9ffc9"></a>

# Nome do Software (ou Biblioteca):

-   TRATAMENTO ESTATÍSTICO DE DADOS GEOQUÍMICOS.


<a id="org7edc9fc"></a>

# Resumo e/ou informação extra:

Em experimentos realizados no laboratório de geoquímica, observa-se que algumas amostras apresentam um valor discrepante com relação as demais.
Por exemplo as percentagens das frações de NSO saturados e aromáticos.
No laboratório tem-se n pesquisadores que utilizam a amostra X, por exemplo, para calcular suas percentagens de saturados, aromáticos e NSO. Sabe-se que cada pesquisador pode encontrar valores diferentes destas percentagens para essa mesma amostra. Tais valores normalmente variam pouco de experimento para experimento, mas há casos em que a percentagem varia consideravelmente. As porcentagens calculadas pelo pesquisador Y apresentam um valor bastante diferente das percentagens de SAT e ARO com relação ao que os outros pesquisadores encontraram. Acredita-se, portanto, que tais valores sejam outliers. A partir desta suspeita é preciso então comprová-la, o que normalmente é feito através dos testes: Teste do escore z modificado, Teste de Grubbs, Teste de Dixon, Teste de Cochran e Teste de Doerffel.
A modelagem foi criada com a intenção de propor um tratamento estatístico de dados geoquímicos a partir da regressão linear, testes de hipótese e identificação de valores anômalos (outliers).
Um exemplo de caso de uso padrão envolve a escolha de um método estatístico para tratar os dados geoquímicos.

1.  Selecionar o tratamento estatístico.
2.  Fornecer dados geoquímicos.
3.  Aplicar o tratamento.
4.  Analisar resultados.


<a id="org84d961d"></a>

# Versão:

-   1.0.


<a id="org8335c69"></a>

# Data:

-   2013/2 - segundo semestre.


<a id="org99dcf16"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orga8cae37"></a>

# Lista dos Autores:

-   Márcio Luís Carvalho Araújo
-   Tamires dos Santos Soares
-   Thiago Rocha Gomes
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org1df3551"></a>

# Áreas de pesquisa vinculadas:

-   Geoquímica
-   Estatística Aplicada
-   Modelagem Matemática Computacional


<a id="orgd4c203f"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="org929265d"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org03eb3d0"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="orgebfe9ce"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="orgf4d6643"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="org9f218d6"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org9a0c2a7"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org3438a1c"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).


<a id="org311f01b"></a>

# Links:

